hidenorly/esp8266_IoT/ESP8266_IoT/UPnPDevice.h
/* 
 Copyright (C) 2018 hidenorly

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

      http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
*/

#ifndef __UPNPDEVICE_H__
#define __UPNPDEVICE_H__

#include "base.h"
#include <ESP8266WebServer.h>

class UPnPDevice
{
public:
	UPnPDevice(String deviceName, int port, String urn, String uuid, String serviceUrl);
	virtual ~UPnPDevice();

	void handle(void);

	void enable(bool bEnable);
	bool getEnabled(void);

	String handleMSearch(String query);

protected:
	bool mEnable;
	String mDeviceName;
	int mBootId;
	String mUrn;
	String mUuid;
	String mServiceUrl;
	int mPort;
	ESP8266WebServer* mpHttpd;

	virtual void _setupHandlers(void);
	virtual void _tearDownHandlers(void);

	virtual void _handleRoot(void);
	virtual void _handleService(void){ DEBUG_PRINTLN("_handleService"); };
	virtual void _handleUpnpControl(void){ DEBUG_PRINTLN("_handleUpnpControl"); };
	virtual void _handleEventservice(void){ DEBUG_PRINTLN("_handleEventservice"); };
};

#endif /* __UPNPDEVICE_H__ */
